package com.company;
/* Дана переменная number.
Напиши программу, которая выводит на экран квадрат этой переменной (number * number). */

public class Main {
    public static void main(String[] args) {
        int number = 25;
        //   System.out.println(number*number);
        int square = number*number;
        System.out.println(square);
    }
}
